In [112]:
import pandas as pd

In [113]:
import numpy as np

In [114]:
from pydataset import data

In [115]:
from env import get_db_url

Three Exercises

Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

Done

cd into your exercises folder for this module and run echo env.py >> .gitignore

Done

Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

Done

Use your function to obtain a connection to the employees database.

In [118]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50',get_db_url("employees"))

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

Once you have successfully run a query:
    A.Intentionally make a typo in the database url. What kind of error message do you see?

In [85]:
print("could not parse url")

could not parse url

b. Intentionally make an error in your SQL query. What does the error message look like?

In [86]:
print("error: access denied 1044")

error: access denied 1044

Read the employees and titles tables into two separate DataFrames.

In [87]:
url = get_db_url("employees")
sql = """
SELECT * FROM employees 

"""
employees = pd.read_sql(sql, url)
employees.shape

(300024, 6)

In [79]:
sql = """
SELECT * FROM titles 
"""

titles = pd.read_sql(sql, url)
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

How many rows and columns do you have in each DataFrame? Is that what you expected?

In [88]:
titles.shape

(443308, 4)

In [89]:
employees.shape

(300024, 6)

Display the summary statistics for each DataFrame.

In [90]:
titles.describe(include='all')

               emp_no     title   from_date     to_date
count   443308.000000    443308      443308      443308
unique            NaN         7        6393        5888
top               NaN  Engineer  1998-10-25  9999-01-01
freq              NaN    115003         132      240124
mean    253075.034430       NaN         NaN         NaN
std     161853.292613       NaN         NaN         NaN
min      10001.000000       NaN         NaN         NaN
25%      84855.750000       NaN         NaN         NaN
50%     249847.500000       NaN         NaN         NaN
75%     424891.250000       NaN         NaN         NaN
max     499999.000000       NaN         NaN         NaN

In [91]:
employees.describe(include='all')

               emp_no  birth_date first_name last_name  gender   hire_date
count   300024.000000      300024     300024    300024  300024      300024
unique            NaN        4750       1275      1637       2        5434
top               NaN  1952-03-08     Shahab      Baba       M  1985-06-20
freq              NaN          95        295       226  179973         132
mean    253321.763392         NaN        NaN       NaN     NaN         NaN
std     161828.235540         NaN        NaN       NaN     NaN         NaN
min      10001.000000         NaN        NaN       NaN     NaN         NaN
25%      85006.750000         NaN        NaN       NaN     NaN         NaN
50%     249987.500000         NaN        NaN       NaN     NaN         NaN
75%     424993.250000         NaN        NaN       NaN     NaN         NaN
max     499999.000000         NaN        NaN       NaN     NaN         NaN

How many unique titles are in the titles DataFrame?

In [92]:
len(titles.title.unique())

7

What is the oldest date in the to_date column?

In [93]:
pd.read_sql("SELECT MAX(to_date) FROM titles", url)

  MAX(to_date)
0   9999-01-01

In [94]:
titles.to_date.min()

datetime.date(1985, 3, 1)

What is the most recent date in the to_date column?

In [95]:
titles.to_date.max()

datetime.date(9999, 1, 1)

## Exercise Two

Like the pandas series object, the pandas DataFrame object supports both position- and label-based indexing using the indexing operator []

### Notes

In [ ]:
df[['x', 'y']]

In [ ]:
bools = df.x.str.startswith('T')
bools 
#will return True or False Statements

In [ ]:
df[bools]
#this will return just the rows that would return 'true'

In [ ]:
df.loc[row_indexer, column_indexer]

In [ ]:
df.loc[bools, 'x': 'y']
#this will return the rows inside the x, y columns that meet the condition

In [ ]:
df.iloc[:3]
#will return first three rows: 0,1,2

In [ ]:
df.iloc[:3, 1:3]
#will return first three rows: 0,1,2 AND first three columns 0,1,2

### Aggregating

In [ ]:
df.reading.agg('min')
#returns the min reading score

In [ ]:
df[['english', 'reading', 'math']] .agg(['mean', 'min', 'max'])
#returns the mean of english, the min of reading, and the max of math

### Group By

In [4]:
df.groupby('classroom').math.max()
#to see top scores in two different classroom

In [ ]:
df.groupby('classroom').math.agg(['min', 'mean', 'max'])
#this groups the rows by classrooms: first hour, second hour and shows min, mean, max

In [ ]:
np.where(condition, this_where_True, this_where_False)
#where function allow us to base the new column values on whether the values in the existing column meet the condition

In [ ]:
df['passing_math'] = np.where(df.math < 70, 'failing', 'passing')
df
#this creates a new column. the output is a column named passing math that returns "passing or failing"

In [ ]:
grade_groups = df.groupby(['column1', 'column2']).reading.agg(['mean', 'count'])
grade_groups
#this will return four colums: column1, column2, mean column, and count column

In [ ]:
#you can rename the columns like this: 
grade_groups.columns = ['avg_reading_grade', 'count_of_students']

### Transform

In [ ]:
df.assign(avg_math_score_by_classroom=df.groupby('classroom').math.transform('mean'))
#This takes the average math score per class and returns it back to the original dataframe that 
#housed all the students so that you can see in Sally's class the average math score is 82

In [ ]:
df.groupby('classroom').reading.describe()
#this shows the count, mean, std, min, 25%, 50%, 75%, max

## Exercises II

Copy the users and roles DataFrames from the examples above.

In [98]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [99]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

What is the result of using a right join on the DataFrames?

In [100]:
users.merge(roles, left_on='role_id', right_on='id', how='right', indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

In [125]:
print("The result of using a right join is receiving all keys from the right table and all the keys that overlap")

The result of using a right join is receiving all keys from the right table and all the keys that overlap

What is the result of using an outer join on the DataFrames?

In [101]:
users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

In [133]:
print("The result of using an outer join is receiving all keys from both tables.")

The result of using an outer join is receiving all keys from both tables.

What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [135]:

print("The ID will not match because there will still be an ID, but the values may not be a perfect match leading to misinformation.")
#error must pass right_on

The ID will not match because there will still be an ID, but the values may not be a perfect match leading to misinformation.

Load the mpg dataset from PyDataset

In [103]:
mpg = data('mpg')
data('mpg')

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

Output and read the documentation for the mpg dataset.

In [8]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

How many rows and columns are in the dataset?

In [17]:
mpg.shape

(234, 11)

In [19]:
print('There are 234 rows and 11 columns')

There are 234 rows and 11 columns

Check out your column names and perform any cleanup you may want on them

In [20]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

Display the summary statistics for the dataset.

In [123]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

How many different manufacturers are there?

In [27]:
mpg.manufacturer.unique().size

15

How many different models are there?

In [26]:
mpg.model.unique().size

38

Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [31]:
mpg['mileage_difference'] = (mpg.hwy - mpg.cty)

Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [32]:
mpg['average_mileage'] = (mpg.cty + mpg.hwy)/(2)

Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [39]:
mpg['is_automatic'] = mpg.trans == 'auto'
print(mpg)
###this is wrong, the auto has numbers attached I am not sure what to do

    manufacturer   model  displ  year  cyl       trans drv  cty  hwy fl  \
1           audi      a4    1.8  1999    4    auto(l5)   f   18   29  p
2           audi      a4    1.8  1999    4  manual(m5)   f   21   29  p
3           audi      a4    2.0  2008    4  manual(m6)   f   20   31  p
4           audi      a4    2.0  2008    4    auto(av)   f   21   30  p
5           audi      a4    2.8  1999    6    auto(l5)   f   16   26  p
..           ...     ...    ...   ...  ...         ...  ..  ...  ... ..
230   volkswagen  passat    2.0  2008    4    auto(s6)   f   19   28  p
231   volkswagen  passat    2.0  2008    4  manual(m6)   f   21   29  p
232   volkswagen  passat    2.8  1999    6    auto(l5)   f   16   26  p
233   volkswagen  passat    2.8  1999    6  manual(m5)   f   18   26  p
234   volkswagen  passat    3.6  2008    6    auto(s6)   f   17   26  p

       class  mileage_difference  average_mileage  is_automatic
1    compact                  11             23.5         False
2    compact                   8             25.0         False
3    compact                  11             25.5         False
4    compact                   9             25.5         False
5    compact                  10             21.0         False
..       ...                 ...              ...           ...
230  midsize                   9             23.5         False
231  midsize                   8             25.0         False
232  midsize                  10             21.0         False
233  midsize                   8             22.0         False
234  midsize                   9             21.5         False

[234 rows x 14 columns]

Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [124]:
mpg.groupby('manufacturer').math.agg(['max'])

AttributeError: 'DataFrameGroupBy' object has no attribute 'math'

Do automatic or manual cars have better miles per gallon?

In [44]:
mpg.groupby('trans').math.agg(['max'])

## Exercises III

Use your get_db_url function to help you explore the data from the chipotle database.

In [121]:
cl = pd.read_sql('SELECT * FROM orders LIMIT 5 OFFSET 50',get_db_url("chipotle"))
cl

,id,order_id,quantity,item_name,choice_description,item_price
0,51,23,1,Steak Burrito,"[Roasted Chili Corn Salsa (Medium), [Rice, Fajita Veggies, Cheese, Sour Cream, Lettuce]]",$8.99
1,52,23,2,Canned Soda,[Mountain Dew],$2.18
2,53,24,1,Chicken Burrito,"[Roasted Chili Corn Salsa (Medium), [Black Beans, Rice, Fajita Veggies, Cheese, Sour C...",$10.98
3,54,24,1,Canned Soda,[Sprite],$1.09
4,55,25,1,Steak Bowl,"[Fresh Tomato Salsa (Mild), [Black Beans, Rice, Fajita Veggies, Cheese, Sour Cream]]",$8.99

What is the total price for each order?

In [ ]:
cl["total_price"]= cl.item

What are the most popular 3 items?

Which item has produced the most revenue?

Join the employees and titles DataFrames together

For each title, find the hire date of the employee that was hired most recently with that title.

Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)